//本国公民的所有个人所得(工资、奖金等)都需要缴纳一定的税款，称为“个人所得税”。
//2018年10月1日，我国个人所得税发生调整，百度搜索新的个人所得税计算公式，
//写出程序，输入当月工资，计算出应缴纳的个人所得税，和实际到手收入

/*级数 全月应纳税所得额 税率（%）

　　1 不超过1500元的 3

　　2 超过1500元至4500元的部分 10

　　3 超过4500元至9000元的部分 20

　　4 超过9000元至35000元的部分 25

　　5 超过35000元至55000元的部分 30

　　6 超过55000元至80000元的部分 35

　　7 超过80000元的部分 45*/

#include<stdio.h>
int main()
{
    int wage=0;
    int a=1500*0.05;
    int b=(4500-1500)*0.10;
    int c=(9000-4500)*0.20;
    int d=(35000-9000)*0.25;
    int e=(55000-35000)*0.30;
    int f=(80000-55000)*0.35;
    printf("请输入你的当月工资:");
    scanf("%d",&wage);

    if(wage>0&&wage<=1500)
    {
        printf("你应缴税为%.2f",wage*0.05);
    }
    if(wage>1500&&wage<=4500)
    {
        printf("你应缴税为%.2f",(wage-1500)*0.10+a);
    }
    if(wage>4500&&wage<=9000)
    {
        printf("你应缴税为%.2f",(wage-4500)*0.20+a+b);
    }
    if(wage>9000&&wage<=35000)
    {
        printf("你应缴税为%.2f",(wage-9000)*0.25+a+b+c);
    }
    if(wage>35000&&wage<=55000)
    {
        printf("你应缴税为%.2f",(wage-35000)*0.30+a+b+c+d);
    }
    if(wage>55000&&wage<=80000)
    {
        printf("你应缴税为%.2f",(wage-55000)*0.35+a+b+c+d+e);
    }
    else
    {
        printf("你应缴税为%.2f",(wage-80000)*0.45+a+b+c+d+e+f);
    }

    return 0;
}